CUSTMAP  DFHMSD TYPE=&SYSPARM,                                        X
               MODE=INOUT,                                            X
               LANG=COBOL,                                            X
               CTRL=FREEKB
CUSTMAP1 DFHMDI SIZE=(24,80),                                         X
               LINE=1,                                                X
               COLUMN=1
         DFHMDF POS=(01,01),                                          X
               LENGTH=20,                                             X
               ATTRB=(PROT,BRT),                                      X
               INITIAL='CUSTOMER MAINTENANCE'
CUSTNOL  DFHMDF POS=(03,01),                                          X
               LENGTH=9,                                              X
               ATTRB=(PROT),                                          X
               INITIAL='Cust No:'
CUSTNO   DFHMDF POS=(03,15),                                          X
               LENGTH=8,                                              X
               ATTRB=(UNPROT,NUM,IC)
         DFHMDF POS=(05,01),                                          X
               LENGTH=6,                                              X
               ATTRB=(PROT),                                          X
               INITIAL='Name:'
CUSTNAM  DFHMDF POS=(05,08),                                          X
               LENGTH=30,                                             X
               ATTRB=(UNPROT)
         DFHMSD TYPE=FINAL
